Importing libraries

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

fetching the dataset: https://www.kaggle.com/datasets/mehmettahiraslan/customer-shopping-dataset

In [9]:
df = pd.read_csv("customer_shopping_data.csv", index_col='invoice_no')
df.head()

,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
invoice_no,,,,,,,,,
I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul
I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity
I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM
I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon

before we analyse the data, lets just look at what we have at our disposal

In [10]:
df.shape

(99457, 9)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 99457 entries, I138884 to I232867
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     99457 non-null  object
 1   gender          99457 non-null  object
 2   age             99457 non-null  int64
 3   category        99457 non-null  object
 4   quantity        99457 non-null  int64
 5   price           99457 non-null  float64
 6   payment_method  99457 non-null  object
 7   invoice_date    99457 non-null  object
 8   shopping_mall   99457 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 7.6+ MB

In [12]:
df.describe()

                age      quantity         price
count  99457.000000  99457.000000  99457.000000
mean      43.427089      3.003429    689.256321
std       14.990054      1.413025    941.184567
min       18.000000      1.000000      5.230000
25%       30.000000      2.000000     45.450000
50%       43.000000      3.000000    203.300000
75%       56.000000      4.000000   1200.320000
max       69.000000      5.000000   5250.000000

lets analyse the data for null and duplicates

In [17]:
df.isnull().sum()

customer_id       0
gender            0
age               0
category          0
quantity          0
price             0
payment_method    0
invoice_date      0
shopping_mall     0
dtype: int64

We don't have any null values in the dataset

In [18]:
df.duplicated().sum()

np.int64(0)

No duplicates found

Lets look at the unique values and unique count to have a better understanding of the data

In [19]:
df.nunique().to_frame(name="Unique count")

                Unique count
customer_id            99457
gender                     2
age                       52
category                   8
quantity                   5
price                     40
payment_method             3
invoice_date             797
shopping_mall             10

In [20]:
df.apply(pd.unique).to_frame(name="Unique values")

                                                    Unique values
customer_id     [C241288, C111565, C266599, C988172, C189076, ...
gender                                             [Female, Male]
age             [28, 21, 20, 66, 53, 49, 32, 69, 60, 36, 29, 6...
category        [Clothing, Shoes, Books, Cosmetics, Food & Bev...
quantity                                          [5, 3, 1, 4, 2]
price           [1500.4, 1800.51, 300.08, 3000.85, 60.6, 40.66...
payment_method                    [Credit Card, Debit Card, Cash]
invoice_date    [5/8/2022, 12/12/2021, 9/11/2021, 16/05/2021, ...
shopping_mall   [Kanyon, Forum Istanbul, Metrocity, Metropol A...